USE P_421_DDL;
GO

INSERT Disciplines(discipline_id, discipline_name, number_of_lessons)
VALUES
(1, N'Процедурное программирование на языке C++', 78),
(2, N'Объектно-ориентированное программирование на языке C++', 58),
(3, N'Разработка Windows-приложений на языке C++', 48),
(4, N'Разработка кроссплатформенных приложений на языке C++', 58),
(5, N'Основы программирования на языке C#', 32),
(6, N'Разработка Windows-приложений на языке C#', 48),
(7, N'Теория Баз данных, программирование MS SQL Server', 48),
(8, N'ADO.NET', 32),
(9, N'Системное программирование', 32),
(10, N'Сетевое программирование', 32);
